In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [65]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                      title  year
0            Entre hermanos  1984
1  Warning: Apocalypse 2012  2012
2            One Dark Night  1939
3              Jungle Siren  1942
4               Shreelancer  2017

In [78]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [32]:
len(titles)

226013

### What are the earliest two films listed in the titles dataframe?

In [37]:
titles.sort_values(by="year")

                                                 title  year
40929                                       Miss Jerry  1894
129236                              The Startled Lover  1898
197063  Reproduction of the Corbett and Jeffries Fight  1899
139439                            Family Troubles (II)  1900
97433                            Soldiers of the Cross  1900
...                                                ...   ...
138366                                 Despicable Me 4  2024
31012                                The Dreams I Have  2024
178590                                        Avatar 5  2025
119046                        The Zero Century: Maetel  2026
112974                                       100 Years  2115

[226013 rows x 2 columns]

### How many movies have the single-word title "Hamlet"?

In [50]:
hamlet_films = titles[titles['title'] == "Hamlet"]
len(hamlet_films)

20

### How many movies are titled "North by Northwest"?

In [49]:
len(titles[titles['title'] == "North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [51]:
hamlet_films.sort_values(by="year")

         title  year
73863   Hamlet  1910
37660   Hamlet  1911
25775   Hamlet  1913
67197   Hamlet  1921
22396   Hamlet  1948
60163   Hamlet  1954
104347  Hamlet  1964
108058  Hamlet  1969
139441  Hamlet  1973
20439   Hamlet  1976
29619   Hamlet  1987
211084  Hamlet  1990
214548  Hamlet  1996
82625   Hamlet  2000
147772  Hamlet  2009
161356  Hamlet  2011
116093  Hamlet  2014
110739  Hamlet  2015
3665    Hamlet  2016
97746   Hamlet  2017

### List all of the "Treasure Island" movies from earliest to most recent.

In [ ]:
island_films = titles[titles['title'] == "Treasure Island"]

island_films.sort_values(by="year")

### How many movies were made in the year 1950?

In [63]:
(titles.year == 1950).sum()

226013

### How many movies were made in the year 1960?

In [66]:
(titles.year == 1960).sum()

1496

### How many movies were made from 1950 through 1959?

In [72]:
titles[(titles.year >= 1950) & (titles.year < 1960)].count()

title    12664
year     12664
dtype: int64

### In what years has a movie titled "Batman" been released?

In [73]:
batman_films = titles[titles['title'] == "Batman"]
batman_films.year

91908     1989
144438    1943
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [76]:
titles[titles["title"] == "Inception"]

            title  year
113436  Inception  2010

In [82]:
inception_cast = cast[cast["title"] == "Inception"]
inception_cast

,title,year,name,type,character,n
90228,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
136913,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
168897,Inception,2010,Tom Berenger,actor,Browning,8.0
181725,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
238644,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3084390,Inception,2010,Ellen Page,actress,Ariadne,3.0
3136148,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3161648,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3168008,Inception,2010,Talulah Riley,actress,Blonde,25.0
3393649,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [83]:
(inception_cast.n.isna()).sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [84]:
(inception_cast.n.notna()).sum()

51

In [85]:
inception_cast

,title,year,name,type,character,n
90228,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
136913,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
168897,Inception,2010,Tom Berenger,actor,Browning,8.0
181725,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
238644,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3084390,Inception,2010,Ellen Page,actress,Ariadne,3.0
3136148,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3161648,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3168008,Inception,2010,Talulah Riley,actress,Blonde,25.0
3393649,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [86]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [119]:
nxnw_cast = cast[cast["title"] == "North by Northwest"]

In [95]:
nxnw_cast[nxnw_cast.n.notna() == True].sort_values(by="n")

,title,year,name,type,character,n
797150,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3201980,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1333732,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2878461,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
326415,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2780220,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1551491,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1167105,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2239203,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1657968,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
609229,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2100440,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
425645,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1379980,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
189719,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1267109,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [99]:
cast[(cast["title"] == "Sleuth") & (cast["year"] == 1972)].sort_values(by="n")

,title,year,name,type,character,n
1560814,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
299291,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
342151,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1341313,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2490141,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1325945,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [100]:
cast[(cast["title"] == "Sleuth") & (cast["year"] == 2007)].sort_values(by="n")

          title  year                 name     type          character    n
299292   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1183659  Sleuth  2007             Jude Law    actor               Milo  2.0
1652936  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
238747   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
342152   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2490140  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3069393  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [103]:
ham21 = cast[(cast["title"] == "Hamlet") & (cast["year"] == 1921)]
len(ham21)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [104]:
ham96 = cast[(cast["title"] == "Hamlet") & (cast["year"] == 1996)]
len(ham96)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [107]:
all_hams_cast = cast[cast["title"] == "Hamlet"]
all_hams = all_hams_cast[all_hams_cast["n"].notna() == True]
len(all_hams)

249

### How many people have played an "Ophelia"?

In [109]:
cast[cast["character"] == "Ophelia"]

,title,year,name,type,character,n
227897,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
375914,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
792558,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1248574,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN
1447261,Kronos,2016,Justine Mooritz,actor,Ophelia,NaN
...,...,...,...,...,...,...
3372861,"Hamlet, Son of a Kingpin",2015,Ingrid Vollset,actress,Ophelia,NaN
3385725,D.C. Cab,1983,Marsha Warfield,actress,Ophelia,7.0
3395743,Hamlet,2015,Katie (II) West,actress,Ophelia,7.0
3408495,National Theatre Live: Rosencrantz & Guildenst...,2017,Helen (IV) Wilson,actress,Ophelia,NaN
3411264,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0

### How many people have played a role called "The Dude"?

In [110]:
cast[cast["character"] == "The Dude"]

,title,year,name,type,character,n
249680,The Big Lebowski,1998,Jeff Bridges,actor,The Dude,1.0
310661,Terms & Conditions,2015,Jordan Cann,actor,The Dude,9.0
456369,Stranger,2000,Scott Crowell,actor,The Dude,NaN
559043,Sweepstakes,1931,Mike Donlin,actor,The Dude,12.0
576028,Self Helpless,2010,Devin The Dude,actor,The Dude,NaN
995984,Jay and Silent Bob Strike Back,2001,Matthew (XIX) James,actor,The Dude,37.0
1041126,Explicit Ills,2008,Christopher Kadish,actor,The Dude,27.0
1251093,American Idiots,2013,Jason Loughridge,actor,The Dude,10.0
1268721,The Winds of Autumn,1976,Steve Lyons,actor,The Dude,30.0
1383848,The Liq,2016,Mark Alan Meek,actor,The Dude,NaN
1409906,Wild Oats Lane,1926,Jerry Miley,actor,The Dude,6.0
1633452,Oklahoma Badlands,1948,House Peters Jr.,actor,The Dude,13.0
1670237,Cloud Air: The Movie,2013,Thomas (VIII) Porter,actor,The Dude,8.0
1683181,Hacks,1997,Jason Priestley,actor,The Dude,11.0
2014892,Carlos Spills the Beans,2013,Bobby Styles,actor,The Dude,NaN
2137847,Zachariah,1971,Dick Van Patten,actor,The Dude,9.0
2214001,It Can Be Arranged,2010,Joel Weiss,actor,The Dude,NaN

### How many people have played a role called "The Stranger"?

In [113]:
cast[cast["character"] == "The Stranger"]

,title,year,name,type,character,n
23933,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,2.0
32992,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0
42785,Hickok,2017,Terral Altom,actor,The Stranger,NaN
61880,Get Mean,1975,Tony Anthony,actor,The Stranger,1.0
61882,Lo straniero di silenzio,1968,Tony Anthony,actor,The Stranger,1.0
...,...,...,...,...,...,...
2921021,The Stranger,1995,Kathy Long,actress,The Stranger,1.0
2933723,Ever Since Eve,1921,Ethel Lynne,actress,The Stranger,7.0
3101273,Weitertanzen,2008,Rosa Maria Paz,actress,The Stranger,NaN
3246470,Motherland,1927,Dorinea Shirley,actress,The Stranger,NaN
3407463,The Seventh,2017,Kerry (II) Willison-Parry,actress,The Stranger,NaN

### How many roles has Sidney Poitier played throughout his career?

In [116]:
sp_films = cast[cast["name"] == "Sidney Poitier"]
len(sp_films)

43

### How many roles has Judi Dench played?

In [118]:
jd_films = cast[cast["name"] == "Judi Dench"]
len(jd_films)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [4]:
len(titles)

226013

In [30]:
h = titles.head(20)
h

                             title  year
0                   Entre hermanos  1984
1         Warning: Apocalypse 2012  2012
2                   One Dark Night  1939
3                     Jungle Siren  1942
4                      Shreelancer  2017
5                   Slingshot Cops  2016
6                      Mama's Boys  1993
7                          Pazhani  2008
8                A Gun to the Head  2009
9                    The Coat Room  2005
10                      Frat Party  2009
11                      Seven Ways  2009
12             La montagna di luce  1965
13                 Pas de scandale  1999
14            Kanun Hamra Muthi Me  2011
15              The Man from Texas  1924
16                  Nelle tue mani  2007
17                            Spin  2007
18  Aeroport so sluzhebnogo vkhoda  1987
19               The Sobbing Stone  2005

In [26]:
h['year'] // 10 * 10

0     1980
1     2010
2     1930
3     1940
4     2010
5     2010
6     1990
7     2000
8     2000
9     2000
10    2000
11    2000
12    1960
13    1990
14    2010
15    1920
16    2000
17    2000
18    1980
19    2000
Name: year, dtype: int64

In [27]:
h.year > 1985

0     False
1      True
2     False
3     False
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12    False
13     True
14     True
15    False
16     True
17     True
18     True
19     True
Name: year, dtype: bool

In [31]:
h[(h.year < 1980) | (h.year >= 1990)]

                       title  year
1   Warning: Apocalypse 2012  2012
2             One Dark Night  1939
3               Jungle Siren  1942
4                Shreelancer  2017
5             Slingshot Cops  2016
6                Mama's Boys  1993
7                    Pazhani  2008
8          A Gun to the Head  2009
9              The Coat Room  2005
10                Frat Party  2009
11                Seven Ways  2009
12       La montagna di luce  1965
13           Pas de scandale  1999
14      Kanun Hamra Muthi Me  2011
15        The Man from Texas  1924
16            Nelle tue mani  2007
17                      Spin  2007
19         The Sobbing Stone  2005